PH_data/alpha_0.5/0/UDDES
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/






FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      UDDES;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];


internalField   nonuniform List<vector> 
10597
(
( -0.00178508705 -0.003661092836 -0.0001923629898 )
( -0.001921877498 -0.003777015721 -0.0001866497623 )
( -0.001650871709 -0.003620300209 -0.0002128957422 )
( -0.001819087774 -0.00375419762 -0.0002162714372 )
( -0.00220392202 -0.003918431234 -0.0001481074723 )
( -0.002204503864 -0.003918882459 -0.000148205756 )
( -0.001397810061 -0.003451323835 -0.0002282990754 )
( -0.002149268286 -0.003978545777 -0.000199125876 )
...
)
;

boundaryField
{
    hill
    {
        type            calculated;
        value           uniform ( 0 0 0 );
    }
    top-wall
    {
        type            calculated;
        value           uniform ( 0 0 0 );
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
    cyclicAMI_outlet
    {
        type            cyclicAMI;
        value           uniform ( 0 0 0 );
    }
    cyclicAMI_inlet
    {
        type            cyclicAMI;
        value           uniform ( 0 0 0 );
    }
}


// ************************************************************************* //
